HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_regdef.h
/**
 * \file IfxEbcu_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Ebcu Ebcu
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Ebcu_Bitfields Bitfields
 * \ingroup IfxLld_Ebcu
 * 
 * \defgroup IfxLld_Ebcu_union Union
 * \ingroup IfxLld_Ebcu
 * 
 * \defgroup IfxLld_Ebcu_struct Struct
 * \ingroup IfxLld_Ebcu
 * 
 */
#ifndef IFXEBCU_REGDEF_H
#define IFXEBCU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Ebcu_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_EBCU_ACCEN0_Bits
{
    Ifx_Strict_32Bit EN0:1;                 /**< \brief [0:0] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN1:1;                 /**< \brief [1:1] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN2:1;                 /**< \brief [2:2] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN3:1;                 /**< \brief [3:3] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN4:1;                 /**< \brief [4:4] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN5:1;                 /**< \brief [5:5] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN6:1;                 /**< \brief [6:6] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN7:1;                 /**< \brief [7:7] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN8:1;                 /**< \brief [8:8] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN9:1;                 /**< \brief [9:9] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN10:1;                /**< \brief [10:10] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN11:1;                /**< \brief [11:11] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN12:1;                /**< \brief [12:12] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN13:1;                /**< \brief [13:13] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN14:1;                /**< \brief [14:14] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN15:1;                /**< \brief [15:15] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN16:1;                /**< \brief [16:16] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN17:1;                /**< \brief [17:17] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN18:1;                /**< \brief [18:18] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN19:1;                /**< \brief [19:19] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN20:1;                /**< \brief [20:20] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN21:1;                /**< \brief [21:21] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN22:1;                /**< \brief [22:22] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN23:1;                /**< \brief [23:23] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN24:1;                /**< \brief [24:24] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN25:1;                /**< \brief [25:25] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN26:1;                /**< \brief [26:26] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN27:1;                /**< \brief [27:27] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN28:1;                /**< \brief [28:28] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN29:1;                /**< \brief [29:29] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN30:1;                /**< \brief [30:30] Access Enable for Master TAG ID x (rw) */
    Ifx_Strict_32Bit EN31:1;                /**< \brief [31:31] Access Enable for Master TAG ID x (rw) */
} Ifx_EBCU_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_EBCU_ACCEN1_Bits
{
    Ifx_Strict_32Bit EN32:1;                /**< \brief [0:0] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN33:1;                /**< \brief [1:1] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN34:1;                /**< \brief [2:2] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN35:1;                /**< \brief [3:3] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN36:1;                /**< \brief [4:4] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN37:1;                /**< \brief [5:5] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN38:1;                /**< \brief [6:6] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN39:1;                /**< \brief [7:7] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN40:1;                /**< \brief [8:8] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN41:1;                /**< \brief [9:9] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN42:1;                /**< \brief [10:10] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN43:1;                /**< \brief [11:11] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN44:1;                /**< \brief [12:12] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN45:1;                /**< \brief [13:13] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN46:1;                /**< \brief [14:14] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN47:1;                /**< \brief [15:15] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN48:1;                /**< \brief [16:16] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN49:1;                /**< \brief [17:17] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN50:1;                /**< \brief [18:18] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN51:1;                /**< \brief [19:19] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN52:1;                /**< \brief [20:20] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN53:1;                /**< \brief [21:21] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN54:1;                /**< \brief [22:22] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN55:1;                /**< \brief [23:23] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN56:1;                /**< \brief [24:24] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN57:1;                /**< \brief [25:25] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN58:1;                /**< \brief [26:26] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN59:1;                /**< \brief [27:27] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN60:1;                /**< \brief [28:28] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN61:1;                /**< \brief [29:29] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN62:1;                /**< \brief [30:30] Access Enable for Master TAG ID x (r) */
    Ifx_Strict_32Bit EN63:1;                /**< \brief [31:31] Access Enable for Master TAG ID x (r) */
} Ifx_EBCU_ACCEN1_Bits;

/** \\brief  EBCU Control Register */
typedef struct _Ifx_EBCU_CON_Bits
{
    Ifx_Strict_32Bit TOUT:16;               /**< \brief [15:0] Bus Time-Out Value (rw) */
    Ifx_Strict_32Bit DBG:1;                 /**< \brief [16:16] Debug Trace Enable (rw) */
    Ifx_Strict_32Bit reserved_17:7;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SPC:8;                 /**< \brief [31:24] Starvation Period Control (rw) */
} Ifx_EBCU_CON_Bits;

/** \\brief  Debug Address 1 Register */
typedef struct _Ifx_EBCU_DBADR1_Bits
{
    Ifx_Strict_32Bit ADR1:32;               /**< \brief [31:0] Debug Trigger Address 1 (rw) */
} Ifx_EBCU_DBADR1_Bits;

