HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_regdef.h
/** \\brief  Debug Address 2 Register */
typedef struct _Ifx_EBCU_DBADR2_Bits
{
    Ifx_Strict_32Bit ADR2:32;               /**< \brief [31:0] Debug Trigger Address 2 (rw) */
} Ifx_EBCU_DBADR2_Bits;

/** \\brief  Debug Trapped Address Register */
typedef struct _Ifx_EBCU_DBADRT_Bits
{
    Ifx_Strict_32Bit FPIADR:32;             /**< \brief [31:0] FPIBus Address Status (rh) */
} Ifx_EBCU_DBADRT_Bits;

/** \\brief  Debug Bus Operation Signals Register */
typedef struct _Ifx_EBCU_DBBOS_Bits
{
    Ifx_Strict_32Bit OPC:4;                 /**< \brief [3:0] Opcode for Signal Status Debug Trigger (rw) */
    Ifx_Strict_32Bit SVM:1;                 /**< \brief [4:4] SVM Signal for Status Debug Trigger (rw) */
    Ifx_Strict_32Bit reserved_5:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WR:1;                  /**< \brief [8:8] Write Signal for Status Debug Trigger (rw) */
    Ifx_Strict_32Bit reserved_9:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RD:1;                  /**< \brief [12:12] Write Signal for Status Debug Trigger (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_EBCU_DBBOS_Bits;

/** \\brief  Debug Trapped Bus Operation Signals Register */
typedef struct _Ifx_EBCU_DBBOST_Bits
{
    Ifx_Strict_32Bit FPIOPC:4;              /**< \brief [3:0] FPIBus Opcode Status (rh) */
    Ifx_Strict_32Bit FPISVM:1;              /**< \brief [4:4] FPIBus Supervisor Mode Status (rh) */
    Ifx_Strict_32Bit FPIACK:2;              /**< \brief [6:5] FPIBus Acknowledge Status (rh) */
    Ifx_Strict_32Bit FPIRDY:1;              /**< \brief [7:7] FPIBus Ready Status (rh) */
    Ifx_Strict_32Bit FPIWR:1;               /**< \brief [8:8] FPIBus Write Indication Status (rh) */
    Ifx_Strict_32Bit FPIRST:2;              /**< \brief [10:9] FPIBus Reset Status (rh) */
    Ifx_Strict_32Bit FPIOPS:1;              /**< \brief [11:11] FPIBus OCDS Suspend Status (rh) */
    Ifx_Strict_32Bit FPIRD:1;               /**< \brief [12:12] FPIBus Read Indication Status (rh) */
    Ifx_Strict_32Bit FPIABORT:1;            /**< \brief [13:13] FPIBus Abort Status (rh) */
    Ifx_Strict_32Bit FPITOUT:1;             /**< \brief [14:14] FPIBus Time-out Status (rh) */
    Ifx_Strict_32Bit reserved_15:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FPITAG:6;              /**< \brief [21:16] FPIBus Master TAG Status (rh) */
    Ifx_Strict_32Bit reserved_22:10;        /**< \brief \internal Reserved */
} Ifx_EBCU_DBBOST_Bits;

/** \\brief  Debug Control Register */
typedef struct _Ifx_EBCU_DBCNTL_Bits
{
    Ifx_Strict_32Bit EO:1;                  /**< \brief [0:0] Status of Debug Support Enable (r) */
    Ifx_Strict_32Bit OA:1;                  /**< \brief [1:1] Status of Breakpoint Logic (r) */
    Ifx_Strict_32Bit reserved_2:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RA:1;                  /**< \brief [4:4] Rearm Breakpoint Logic (w) */
    Ifx_Strict_32Bit reserved_5:7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CONCOM0:1;             /**< \brief [12:12] Grant and Address Trigger Relation (rw) */
    Ifx_Strict_32Bit CONCOM1:1;             /**< \brief [13:13] Address 1 and Address 2 Trigger Relation (rw) */
    Ifx_Strict_32Bit CONCOM2:1;             /**< \brief [14:14] Address and Signal Trigger Relation (rw) */
    Ifx_Strict_32Bit reserved_15:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ONG:1;                 /**< \brief [16:16] Grant Trigger Enable (rw) */
    Ifx_Strict_32Bit reserved_17:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ONA1:2;                /**< \brief [21:20] Address 1 Trigger Control (rw) */
    Ifx_Strict_32Bit reserved_22:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ONA2:2;                /**< \brief [25:24] Address 2 Trigger Control (rw) */
    Ifx_Strict_32Bit reserved_26:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ONBOS0:1;              /**< \brief [28:28] Opcode Signal Status Trigger Condition (rw) */
    Ifx_Strict_32Bit ONBOS1:1;              /**< \brief [29:29] Supervisor Mode Signal Trigger Condition (rw) */
    Ifx_Strict_32Bit ONBOS2:1;              /**< \brief [30:30] Write Signal Trigger Condition (rw) */
    Ifx_Strict_32Bit ONBOS3:1;              /**< \brief [31:31] Read Signal Trigger Condition (rw) */
} Ifx_EBCU_DBCNTL_Bits;

/** \\brief  Debug Data Status Register */
typedef struct _Ifx_EBCU_DBDAT_Bits
{
    Ifx_Strict_32Bit FPIDATA:32;            /**< \brief [31:0] FPIBus Data Status (rh) */
} Ifx_EBCU_DBDAT_Bits;

/** \\brief  Debug Trapped Master Register */
typedef struct _Ifx_EBCU_DBGNTT_Bits
{
    Ifx_Strict_32Bit FPIGNT0:1;             /**< \brief [0:0] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT1:1;             /**< \brief [1:1] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT2:1;             /**< \brief [2:2] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT3:1;             /**< \brief [3:3] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT4:1;             /**< \brief [4:4] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT5:1;             /**< \brief [5:5] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT6:1;             /**< \brief [6:6] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT7:1;             /**< \brief [7:7] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT8:1;             /**< \brief [8:8] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT9:1;             /**< \brief [9:9] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT10:1;            /**< \brief [10:10] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT11:1;            /**< \brief [11:11] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT12:1;            /**< \brief [12:12] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT13:1;            /**< \brief [13:13] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT14:1;            /**< \brief [14:14] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT15:1;            /**< \brief [15:15] Master x Grant Status (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_EBCU_DBGNTT_Bits;

/** \\brief  Debug Grant Mask Register */
typedef struct _Ifx_EBCU_DBGRNT_Bits
{
    Ifx_Strict_32Bit FPIGNT0:1;             /**< \brief [0:0] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT1:1;             /**< \brief [1:1] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT2:1;             /**< \brief [2:2] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT3:1;             /**< \brief [3:3] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT4:1;             /**< \brief [4:4] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT5:1;             /**< \brief [5:5] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT6:1;             /**< \brief [6:6] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT7:1;             /**< \brief [7:7] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT8:1;             /**< \brief [8:8] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT9:1;             /**< \brief [9:9] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT10:1;            /**< \brief [10:10] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT11:1;            /**< \brief [11:11] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT12:1;            /**< \brief [12:12] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT13:1;            /**< \brief [13:13] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT14:1;            /**< \brief [14:14] Master x Grant Status (rw) */
    Ifx_Strict_32Bit FPIGNT15:1;            /**< \brief [15:15] Master x Grant Status (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_EBCU_DBGRNT_Bits;

/** \\brief  Error Address Capture Register */
typedef struct _Ifx_EBCU_EADD_Bits
{
    Ifx_Strict_32Bit FPIADR:32;             /**< \brief [31:0] Captured FPIBus Address (rwh) */
} Ifx_EBCU_EADD_Bits;

/** \\brief  Error Control Capture Register */
typedef struct _Ifx_EBCU_ECON_Bits
{
    Ifx_Strict_32Bit ERRCNT:14;             /**< \brief [13:0] FPIBus Error Counter (rwh) */
    Ifx_Strict_32Bit TOUT:1;                /**< \brief [14:14] State of FPIBus Time-Out Signal (rwh) */
    Ifx_Strict_32Bit RDY:1;                 /**< \brief [15:15] State of FPIBus Ready Signal (rwh) */
    Ifx_Strict_32Bit ABT:1;                 /**< \brief [16:16] State of FPI Bus Abort Signal (rwh) */
    Ifx_Strict_32Bit ACK:2;                 /**< \brief [18:17] State of FPIBus Acknowledge Signals (rwh) */
    Ifx_Strict_32Bit SVM:1;                 /**< \brief [19:19] State of FPIBus Supervisor Mode Signal (rwh) */
    Ifx_Strict_32Bit WRN:1;                 /**< \brief [20:20] State of FPIBus Write Signal (rwh) */
    Ifx_Strict_32Bit RDN:1;                 /**< \brief [21:21] State of FPIBus Read Signal (rwh) */
    Ifx_Strict_32Bit TAG:6;                 /**< \brief [27:22] FPIBus Master Tag Number Signals (rwh) */
    Ifx_Strict_32Bit OPC:4;                 /**< \brief [31:28] FPIBus Operation Code Signals (rwh) */
} Ifx_EBCU_ECON_Bits;

/** \\brief  Error Data Capture Register */
typedef struct _Ifx_EBCU_EDAT_Bits
{
    Ifx_Strict_32Bit FPIDAT:32;             /**< \brief [31:0] Captured FPIBus Address (rwh) */
} Ifx_EBCU_EDAT_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_EBCU_ID_Bits
{
    Ifx_Strict_32Bit MODREV:8;              /**< \brief [7:0] Module Revision Number (r) */
    Ifx_Strict_32Bit MODNUMBER:8;           /**< \brief [15:8] Module Number Value (r) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_EBCU_ID_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_EBCU_PRIOH_Bits
{
    Ifx_Strict_32Bit MASTER8:4;             /**< \brief [3:0] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER9:4;             /**< \brief [7:4] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER10:4;            /**< \brief [11:8] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER11:4;            /**< \brief [15:12] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER12:4;            /**< \brief [19:16] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER13:4;            /**< \brief [23:20] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER14:4;            /**< \brief [27:24] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER15:4;            /**< \brief [31:28] Master x Priority (rw) */
} Ifx_EBCU_PRIOH_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_EBCU_PRIOL_Bits
{
    Ifx_Strict_32Bit MASTER0:4;             /**< \brief [3:0] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER1:4;             /**< \brief [7:4] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER2:4;             /**< \brief [11:8] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER3:4;             /**< \brief [15:12] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER4:4;             /**< \brief [19:16] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER5:4;             /**< \brief [23:20] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER6:4;             /**< \brief [27:24] Master x Priority (rw) */
    Ifx_Strict_32Bit MASTER7:4;             /**< \brief [31:28] Master x Priority (rw) */
} Ifx_EBCU_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ebcu_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_ACCEN0_Bits B;
} Ifx_EBCU_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_ACCEN1_Bits B;
} Ifx_EBCU_ACCEN1;

/** \\brief  EBCU Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_CON_Bits B;
} Ifx_EBCU_CON;

/** \\brief  Debug Address 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBADR1_Bits B;
} Ifx_EBCU_DBADR1;

