HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_regdef.h
/** \\brief  Debug Address 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBADR2_Bits B;
} Ifx_EBCU_DBADR2;

/** \\brief  Debug Trapped Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBADRT_Bits B;
} Ifx_EBCU_DBADRT;

/** \\brief  Debug Bus Operation Signals Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBBOS_Bits B;
} Ifx_EBCU_DBBOS;

/** \\brief  Debug Trapped Bus Operation Signals Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBBOST_Bits B;
} Ifx_EBCU_DBBOST;

/** \\brief  Debug Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBCNTL_Bits B;
} Ifx_EBCU_DBCNTL;

/** \\brief  Debug Data Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBDAT_Bits B;
} Ifx_EBCU_DBDAT;

/** \\brief  Debug Trapped Master Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBGNTT_Bits B;
} Ifx_EBCU_DBGNTT;

/** \\brief  Debug Grant Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_DBGRNT_Bits B;
} Ifx_EBCU_DBGRNT;

/** \\brief  Error Address Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_EADD_Bits B;
} Ifx_EBCU_EADD;

/** \\brief  Error Control Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_ECON_Bits B;
} Ifx_EBCU_ECON;

/** \\brief  Error Data Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_EDAT_Bits B;
} Ifx_EBCU_EDAT;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_ID_Bits B;
} Ifx_EBCU_ID;

/** \\brief  Arbiter Priority Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_PRIOH_Bits B;
} Ifx_EBCU_PRIOH;

/** \\brief  Arbiter Priority Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBCU_PRIOL_Bits B;
} Ifx_EBCU_PRIOL;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ebcu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  EBCU object */
typedef volatile struct _Ifx_EBCU
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_EBCU_ID ID;                         /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_EBCU_CON CON;                       /**< \brief 10, EBCU Control Register */
    Ifx_EBCU_PRIOH PRIOH;                   /**< \brief 14, Arbiter Priority Register */
    Ifx_EBCU_PRIOL PRIOL;                   /**< \brief 18, Arbiter Priority Register */
    unsigned char reserved_1C[4];           /**< \brief 1C, \internal Reserved */
    Ifx_EBCU_ECON ECON;                     /**< \brief 20, Error Control Capture Register */
    Ifx_EBCU_EADD EADD;                     /**< \brief 24, Error Address Capture Register */
    Ifx_EBCU_EDAT EDAT;                     /**< \brief 28, Error Data Capture Register */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_EBCU_DBCNTL DBCNTL;                 /**< \brief 30, Debug Control Register */
    Ifx_EBCU_DBGRNT DBGRNT;                 /**< \brief 34, Debug Grant Mask Register */
    Ifx_EBCU_DBADR1 DBADR1;                 /**< \brief 38, Debug Address 1 Register */
    Ifx_EBCU_DBADR2 DBADR2;                 /**< \brief 3C, Debug Address 2 Register */
    Ifx_EBCU_DBBOS DBBOS;                   /**< \brief 40, Debug Bus Operation Signals Register */
    Ifx_EBCU_DBGNTT DBGNTT;                 /**< \brief 44, Debug Trapped Master Register */
    Ifx_EBCU_DBADRT DBADRT;                 /**< \brief 48, Debug Trapped Address Register */
    Ifx_EBCU_DBBOST DBBOST;                 /**< \brief 4C, Debug Trapped Bus Operation Signals Register */
    Ifx_EBCU_DBDAT DBDAT;                   /**< \brief 50, Debug Data Status Register */
    unsigned char reserved_54[164];         /**< \brief 54, \internal Reserved */
    Ifx_EBCU_ACCEN1 ACCEN1;                 /**< \brief F8, Access Enable Register 1 */
    Ifx_EBCU_ACCEN0 ACCEN0;                 /**< \brief FC, Access Enable Register 0 */
} Ifx_EBCU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEBCU_REGDEF_H */
